## Pandas: Attributes, Methods and Functions

In [1]:
import pandas as pd
import numpy as np

In [2]:
df_exams = pd.read_csv('datasets/StudentsPerformance.csv')
df_exams.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75

### Basic Attributes of a DataFrame

In [3]:
# Shape: (rows, cols)
df_exams.shape

(1000, 8)

In [4]:
# Index attribute
# RangeIndex(start, stop (last element), step)
df_exams.index

RangeIndex(start=0, stop=1000, step=1)

In [5]:
# Column attribute: List of name of columns
df_exams.columns

Index(['gender', 'race/ethnicity', 'parental level of education', 'lunch',
       'test preparation course', 'math score', 'reading score',
       'writing score'],
      dtype='object')

In [6]:
# Data types of each column
# strings --> type object
df_exams.dtypes

gender                         object
race/ethnicity                 object
parental level of education    object
lunch                          object
test preparation course        object
math score                      int64
reading score                   int64
writing score                   int64
dtype: object

### Methods

In [7]:
# show first 5 rows
df_exams.head(5)

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75

In [8]:
# showing the info of the dataframe
df_exams.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
 #   Column                       Non-Null Count  Dtype
---  ------                       --------------  -----
 0   gender                       1000 non-null   object
 1   race/ethnicity               1000 non-null   object
 2   parental level of education  1000 non-null   object
 3   lunch                        1000 non-null   object
 4   test preparation course      1000 non-null   object
 5   math score                   1000 non-null   int64
 6   reading score                1000 non-null   int64
 7   writing score                1000 non-null   int64
dtypes: int64(3), object(5)
memory usage: 62.6+ KB

In [9]:
# Describe basic statistics of the dataframe
# Count, Mean, Standard Deviation, Min/Max, Quartiles
df_exams.describe()

       math score  reading score  writing score
count  1000.00000    1000.000000    1000.000000
mean     66.08900      69.169000      68.054000
std      15.16308      14.600192      15.195657
min       0.00000      17.000000      10.000000
25%      57.00000      59.000000      57.750000
50%      66.00000      70.000000      69.000000
75%      77.00000      79.000000      79.000000
max     100.00000     100.000000     100.000000

### Functions

In [10]:
# Length (number of rows) of the dataframe
len(df_exams)

1000

In [11]:
# Highest index of the dataframe: corresponds to the last entry on the dataframe
max(df_exams.index)

999

In [12]:
# Lowest index for the dataframe
min(df_exams.index)

0

In [13]:
# Obtain the data type of the DataFrame
type(df_exams)

pandas.core.frame.DataFrame

In [14]:
# Rounding values of the dataset
round(df_exams, 2)

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75
...,...,...,...,...,...,...,...,...
995,female,group E,master's degree,standard,completed,88,99,95
996,male,group C,high school,free/reduced,none,62,55,55
997,female,group C,high school,free/reduced,completed,59,71,65
998,female,group D,some college,standard,completed,68,78,77
999,female,group D,some college,free/reduced,none,77,86,86

## **Selecting columns**
### Select one column

In [15]:
# Select column with []
df_exams['gender']

0      female
1      female
2      female
3        male
4        male
        ...
995    female
996      male
997    female
998    female
999    female
Name: gender, Length: 1000, dtype: object

In [16]:
# A column has a type of Series
type(df_exams['gender'])

pandas.core.series.Series

In [17]:
# Select column with dot notation
df_exams.gender

0      female
1      female
2      female
3        male
4        male
        ...
995    female
996      male
997    female
998    female
999    female
Name: gender, Length: 1000, dtype: object

### Select two or more columns

In [18]:
  # Using the [[]] (nested square brackets)
df_exams[["test preparation course", "math score", "reading score", "writing score"]]

    test preparation course  math score  reading score  writing score
0                      none          72             72             74
1                 completed          69             90             88
2                      none          90             95             93
3                      none          47             57             44
4                      none          76             78             75
..                      ...         ...            ...            ...
995               completed          88             99             95
996                    none          62             55             55
997               completed          59             71             65
998               completed          68             78             77
999                    none          77             86             86

[1000 rows x 4 columns]

In [19]:
type(df_exams[["math score", "reading score"]])

pandas.core.frame.DataFrame

In [20]:
# Nested square brackets would always return a DataFrame
type(df_exams[["test preparation course"]])

pandas.core.frame.DataFrame

## **Adding a new column**

In [21]:
# Add a new column with a scalar value.
# Every row of the new column shares the same value
df_exams['language score'] = 85
df_exams

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score,language score
0,female,group B,bachelor's degree,standard,none,72,72,74,85
1,female,group C,some college,standard,completed,69,90,88,85
2,female,group B,master's degree,standard,none,90,95,93,85
3,male,group A,associate's degree,free/reduced,none,47,57,44,85
4,male,group C,some college,standard,none,76,78,75,85
...,...,...,...,...,...,...,...,...,...
995,female,group E,master's degree,standard,completed,88,99,95,85
996,male,group C,high school,free/reduced,none,62,55,55,85
997,female,group C,high school,free/reduced,completed,59,71,65,85
998,female,group D,some college,standard,completed,68,78,77,85
999,female,group D,some college,free/reduced,none,77,86,86,85

In [22]:
# Add new column with an array
# The dataframe has 1000 rows, hence 1000 elements is needed

# 1000 random elements in a list in range [50, 85] ("high" argument exclusive)
lang_score = np.random.randint(50, 85+1, 1000) # length must either be a scalar or match index's length
df_exams['language score'] = lang_score
df_exams

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score,language score
0,female,group B,bachelor's degree,standard,none,72,72,74,61
1,female,group C,some college,standard,completed,69,90,88,63
2,female,group B,master's degree,standard,none,90,95,93,57
3,male,group A,associate's degree,free/reduced,none,47,57,44,64
4,male,group C,some college,standard,none,76,78,75,64
...,...,...,...,...,...,...,...,...,...
995,female,group E,master's degree,standard,completed,88,99,95,63
996,male,group C,high school,free/reduced,none,62,55,55,73
997,female,group C,high school,free/reduced,completed,59,71,65,83
998,female,group D,some college,standard,completed,68,78,77,77
999,female,group D,some college,free/reduced,none,77,86,86,71

## **Series: Attributes and Methods**

In [23]:
# Index
df_exams['gender'].index

RangeIndex(start=0, stop=1000, step=1)

In [24]:
df_exams['gender'].head()

0    female
1    female
2    female
3      male
4      male
Name: gender, dtype: object